<?php include 'condb_form18.php';
?>

<?php
   
  

    $firstname = $_POST['ชื่อ'];
    $lastname = $_POST['นามสกุล'];
    $รหัสนิสิต = $_POST['รหัสนิสิต'];
    $เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
    $email = $_POST['email'];
    $การเรียนการสอน = $_POST['การเรียนการสอน'];
    $คณะ = $_POST['คณะ'];
    $รหัสสาขา = $_POST['รหัสสาขา'];
    $ชั้นปี = $_POST['ชั้นปี'];
    $กำหนดการขอพักการศึกษา = $_POST['กำหนดการขอพักการศึกษา'];
    $ปีการศึกษา = $_POST['ปีการศึกษา'];
    $ความประสงค์ที่จะขอลาพักการศึกษา = $_POST['ความประสงค์ที่จะขอลาพักการศึกษา'];
    $คำยินยอมของผู้ปกครอง = $_POST['คำยินยอมของผู้ปกครอง'];
    
   



    mysqli_query ($con_form18, "INSERT INTO  form18(ชื่อ, นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน, คณะ, รหัสสาขา, ชั้นปี, กำหนดการขอพักการศึกษา, ปีการศึกษา, ความประสงค์ที่จะขอลาพักการศึกษา, คำยินยอมของผู้ปกครอง,สถานะ)
            VALUES ('$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์','$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี',
        '$กำหนดการขอพักการศึกษา','$ปีการศึกษา','$ความประสงค์ที่จะขอลาพักการศึกษา','$คำยินยอมของผู้ปกครอง','รออนุมัติ')");
    
      echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";
   
exit;

?>



