<?php include 'condb_form8.php';
?>

<?php
   
  

    $firstname = $_POST['ชื่อ'];
    $lastname = $_POST['นามสกุล'];
    $รหัสนิสิต = $_POST['รหัสนิสิต'];
    $เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
    $email = $_POST['email'];
    $การเรียนการสอน = $_POST['การเรียนการสอน'];
    $คณะ = $_POST['คณะ'];
    $รหัสสาขา = $_POST['รหัสสาขา'];
    $ชั้นปี = $_POST['ชั้นปี'];
    $ประสงค์ในภาค = $_POST['ภาค'];
    $ปีการศึกษา = $_POST['ปีการศึกษา'];
    $เนื่องจาก = $_POST['เนื่องจาก'];
    $รหัสวิชา = $_POST['รหัสวิชา'];
    $ชื่อวิชา = $_POST['ชื่อวิชา'];
    $จำนวนหน่วยกิต = $_POST['จำนวนหน่วยกิต'];
    $หมู่เรียน = $_POST['หมู่เรียน'];



    mysqli_query ($con_form8, "INSERT INTO  form8 (ชื่อ, นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน, คณะ, รหัสสาขา, ชั้นปี, ประสงค์ในภาค, ปีการศึกษา,  เนื่องจาก, รหัสวิชา, ชื่อวิชา, จำนวนหน่วยกิต, หมู่เรียน ,สถานะ )
            VALUES ('$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์' ,'$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี','$ประสงค์ในภาค','$ปีการศึกษา','$เนื่องจาก','$รหัสวิชา','$ชื่อวิชา','$จำนวนหน่วยกิต','$หมู่เรียน','รออนุมัติ')");
   
      echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";
   
exit;

?>



