<?php include 'condb_form13.php';
?>


<?php
   
	

  	$firstname = $_POST['ชื่อ'];
  	$lastname = $_POST['นามสกุล'];
  	$รหัสนิสิต = $_POST['รหัสนิสิต'];
  	$เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
  	$email = $_POST['email'];
  	$การเรียนการสอน = $_POST['การเรียนการสอน'];
  	$คณะ = $_POST['คณะ'];
  	$รหัสสาขา = $_POST['รหัสสาขา'];
  	$ชั้นปี = $_POST['ชั้นปี'];
    $ขอเทียบรายวิชาในภาค = $_POST['ภาค'];
    $ปีการศึกษา = $_POST['ปีการศึกษา'];
    $รหัสวิชาที่เรียน = $_POST['รหัสวิชาที่เรียน'];
    $ชื่อวิชาที่เรียน = $_POST['ชื่อวิชาที่เรียน'];
    $ผลการเรียนที่เรียน = $_POST['ผลการเรียนที่เรียน'];
    $รหัสวิชาที่ขอเทียบ = $_POST['รหัสวิชาที่ขอเทียบ'];
    $ชื่อวิชาที่ขอเทียบ = $_POST['ชื่อวิชาที่ขอเทียบ'];
    $ผลการเรียนที่ขอเทียบ = $_POST['ผลการเรียนที่ขอเทียบ'];
  	$เนื่องจาก = $_POST['เนื่องจาก'];

  	mysqli_query ($con_form13, "INSERT INTO  form13(ชื่อ, นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน, คณะ, รหัสสาขา, ชั้นปี,  ขอเทียบรายวิชาในภาค, ปีการศึกษา, รหัสวิชาที่เรียน, ชื่อวิชาที่เรียน, ผลการเรียนที่เรียน, รหัสวิชาที่ขอเทียบ, ชื่อวิชาที่ขอเทียบ, ผลการเรียนที่ขอเทียบ, เนื่องจาก,สถานะ)
  							 VALUES ('$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์' ,'$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี',
                 '$ขอเทียบรายวิชาในภาค','$ปีการศึกษา','$รหัสวิชาที่เรียน','$ชื่อวิชาที่เรียน','$ผลการเรียนที่เรียน','$รหัสวิชาที่ขอเทียบ','$ชื่อวิชาที่ขอเทียบ',
                 '$ผลการเรียนที่ขอเทียบ','$เนื่องจาก','รออนุมัติ')");

    

    echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";
   
exit;

?>