<?php include 'condb_form1.php';
?>


<?php
   
	

  	$firstname = $_POST['ชื่อ'];
  	$lastname = $_POST['นามสกุล'];
  	$รหัสนิสิต = $_POST['รหัสนิสิต'];
  	$เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
  	$email = $_POST['email'];
  	$การเรียนการสอน = $_POST['การเรียนการสอน'];
  	$คณะ = $_POST['คณะ'];
  	$รหัสสาขา = $_POST['รหัสสาขา'];
  	$ชั้นปี = $_POST['ชั้นปี'];
  	$เนื่องจาก = $_POST['จุดประสงค์'];

  	mysqli_query ($con_form1, "INSERT INTO  form1 (ชื่อ, นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน, คณะ, รหัสสาขา, ชั้นปี, จุดประสงค์,สถานะ)
  							 VALUES ('$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์' ,'$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี','$เนื่องจาก','รออนุมัติ')");

    echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";

   
exit;

?>