<?php include 'condb_form6.php';
?>

<?php
   
	

  	$firstname = $_POST['ชื่อ'];
  	$lastname = $_POST['นามสกุล'];
  	$รหัสนิสิต = $_POST['รหัสนิสิต'];
  	$เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
  	$email = $_POST['email'];
  	$การเรียนการสอน = $_POST['การเรียนการสอน'];
  	$คณะ = $_POST['คณะ'];
  	$รหัสสาขา = $_POST['รหัสสาขา'];
  	$ชั้นปี = $_POST['ชั้นปี'];
    $ประสงค์ในภาค = $_POST['ภาค'];
    $ปีการศึกษา = $_POST['ปีการศึกษา'];
    $คะแนนเฉลี่ยสะสม = $_POST['คะแนนเฉลี่ยสะสม'];
    $รหัสวิชา = $_POST['รหัสวิชา'];
    $ชื่อวิชา = $_POST['ชื่อวิชา'];
    $หมู่เรียน = $_POST['หมู่เรียน'];
    $เนื่องจาก = $_POST['เนื่องจาก'];



  	mysqli_query ($con_form6, "INSERT INTO  form6 (ชื่อ, นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน, คณะ, รหัสสาขา, ชั้นปี, ประสงค์ในภาค, ปีการศึกษา, คะแนนเฉลี่ยสะสม,  รหัสวิชา, ชื่อวิชา,  หมู่เรียน ,เนื่องจาก,สถานะ )
  					VALUES ('$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์' ,'$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี','$ประสงค์ในภาค','$ปีการศึกษา','$คะแนนเฉลี่ยสะสม','$รหัสวิชา','$ชื่อวิชา','$หมู่เรียน','$เนื่องจาก','รออนุมัติ')");
   
      echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";
   
exit;

?>




