<?php include 'condb_form10.php';
?>

<?php
   
	

  	$firstname = $_POST['ชื่อ'];
  	$lastname = $_POST['นามสกุล'];
  	$รหัสนิสิต = $_POST['รหัสนิสิต'];
  	$เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
  	$email = $_POST['email'];
  	$การเรียนการสอน = $_POST['การเรียนการสอน'];
  	$คณะ = $_POST['คณะ'];
  	$รหัสสาขา = $_POST['รหัสสาขา'];
  	$ชั้นปี = $_POST['ชั้นปี'];
    $ขอคืนเงินค่าหน่วยกิต = $_POST['ขอคืนเงินค่าหน่วยกิตในภาค'];
    $ปีการศึกษา = $_POST['ปีการศึกษา'];
    $จำนวนA = $_POST['จำนวนA'];
    $ขอคืนค่าลงทะเบียนเรียน = $_POST['ขอคืนค่าลงทะเบียนเรียน'];
    $ขอคืนค่าลงทะเบียนเรียนในภาค = $_POST['ภาค'];
  	$เนื่องจาก = $_POST['จุดประสงค์'];
    $ช่องทางการคืนเงิน = $_POST['ธนาคาร'];
    $ขื่อบัญชี = $_POST['ชื่อบัญชี'];
    $เลขที่บัญชี = $_POST['เลขบัญชี'];


  	mysqli_query ($con_form10, "INSERT INTO  form10 (ชื่อ, นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน, คณะ, รหัสสาขา, ชั้นปี, ขอคืนเงินค่าหน่วยกิต, ปีการศึกษา,จำนวนA, ขอคืนค่าลงทะเบียนเรียน,ขอคืนค่าลงทะเบียนเรียนในภาค, จุดประสงค์,ช่องทางการคืนเงิน,ขื่อบัญชี,เลขที่บัญชี,สถานะ)
  							 VALUES ('$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์' ,'$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี',
                 '$ขอคืนเงินค่าหน่วยกิต' ,'$ปีการศึกษา', '$จำนวนA','$ขอคืนค่าลงทะเบียนเรียน','$ขอคืนค่าลงทะเบียนเรียนในภาค','$เนื่องจาก','$ช่องทางการคืนเงิน','ขื่อบัญชี','เลขที่บัญชี','รออนุมัติ')");

    
      echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";
   
exit;

?>




