<?php include 'condb_form11.php';
?>


<?php
   
	

  	$firstname = $_POST['ชื่อ'];
  	$lastname = $_POST['นามสกุล'];
  	$รหัสนิสิต = $_POST['รหัสนิสิต'];
  	$เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
  	$email = $_POST['email'];
  	$การเรียนการสอน = $_POST['การเรียนการสอน'];
  	$คณะ = $_POST['คณะ'];
  	$รหัสสาขา = $_POST['รหัสสาขา'];
  	$ชั้นปี = $_POST['ชั้นปี'];
    $ย้ายเข้าคณะ = $_POST['ย้ายเข้าคณะ'];
    $ย้ายเข้าสาขา = $_POST['ย้ายเข้าสาขา'];
    $รหัสสาขาที่ย้ายเข้า = $_POST['รหัสสาขาที่ย้ายเข้า'];
    $ตั้งแต่ภาค = $_POST['ภาค'];
    $ปีการศึกษา = $_POST['ปีการศึกษา'];
    $เนื่องจาก = $_POST['เนื่องจาก'];
    $ชื่อผู้ปกครอง = $_POST['ชื่อผู้ปกครอง'];
    $นามสกุลผู้ปกครอง =$_POST['นามสกุลผู้ปกครอง'];
    $เบอร์ผู้ปกครอง = $_POST['เบอร์ผู้ปกครอง'];
    $อนุญาติ = $_POST['อนุญาติ'];
    $ความสัมพันพ์เป็น = $_POST['ความสัมพันพ์เป็น'];

  	mysqli_query($con_form11, "INSERT INTO  form11(ชื่อ , นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน,  คณะ, รหัสสาขา,  ชั้นปี,  ย้ายเข้าคณะ, ย้ายเข้าสาขา,  รหัสสาขาที่ย้ายเข้า, ตั้งแต่ภาค,  ปีการศึกษา,  เนื่องจาก, ชื่อผู้ปกครอง, นามสกุลผู้ปกครอง,  เบอร์ผู้ปกครอง,  อนุญาติ, ความสัมพันพ์เป็น,สถานะ) 
      VALUES ( '$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์' ,'$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี','$ย้ายเข้าคณะ','$ย้ายเข้าสาขา', '$รหัสสาขาที่ย้ายเข้า', ' $ตั้งแต่ภาค', '$ปีการศึกษา', '$เนื่องจาก', '$ชื่อผู้ปกครอง','$นามสกุลผู้ปกครอง','$เบอร์ผู้ปกครอง','$อนุญาติ', '$ความสัมพันพ์เป็น','รออนุมัติ')");

    echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";
  
exit;

?>