<?php include 'condb_form15.php';
?>

<?php
   
  

    $firstname = $_POST['ชื่อ'];
    $lastname = $_POST['นามสกุล'];
    $รหัสนิสิต = $_POST['รหัสนิสิต'];
    $เบอร์โทรศัพท์ = $_POST['เบอร์โทรศัพท์'];
    $email = $_POST['email'];
    $การเรียนการสอน = $_POST['การเรียนการสอน'];
    $คณะ = $_POST['คณะ'];
    $รหัสสาขา = $_POST['รหัสสาขา'];
    $ชั้นปี = $_POST['ชั้นปี'];
    $ขอเรียนควบในภาค = $_POST['ภาค'];
    $ปีการศึกษา = $_POST['ปีการศึกษา'];
    $คะแนนเฉลี่ยสะสม = $_POST['คะแนนเฉลี่ยสะสม'];
    $รหัสวิชาวิชาบังคับก่อน = $_POST['รหัสวิชาวิชาบังคับก่อน'];
    $ชื่อวิชาวิชาบังคับก่อน = $_POST['ชื่อวิชาวิชาบังคับก่อน'];
    $ระดับคะแนนเดิม = $_POST['ระดับคะแนนเดิม'];
    $หมู่ลงทะเบียนเทอมปัจจุบัน = $_POST['หมู่ลงทะเบียนเทอมปัจจุบัน'];
    $รหัสวิชาวิชาต่อเนื่อง = $_POST['รหัสวิชาวิชาต่อเนื่อง'];
    $ชื่อวิชาวิชาต่อเนื่อง = $_POST['ชื่อวิชาวิชาต่อเนื่อง'];
    $หมู่เรียนวิชาต่อเนื่อง = $_POST['หมู่เรียนวิชาต่อเนื่อง'];
    $เนื่องจาก = $_POST['เนื่องจาก'];



    mysqli_query ($con_form15, "INSERT INTO  form15 (ชื่อ, นามสกุล, รหัสนิสิต, เบอร์โทรศัพท์, email, การเรียนการสอน, คณะ, รหัสสาขา, ชั้นปี, ขอเรียนควบในภาค, ปีการศึกษา, คะแนนเฉลี่ยสะสม,รหัสวิชาวิชาบังคับก่อน,ชื่อวิชาวิชาบังคับก่อน,ระดับคะแนนเดิม,หมู่ลงทะเบียนเทอมปัจจุบัน,รหัสวิชาวิชาต่อเนื่อง,
        ชื่อวิชาวิชาต่อเนื่อง,หมู่เรียนวิชาต่อเนื่อง,เนื่องจาก,สถานะ)
        VALUES ('$firstname','$lastname','$รหัสนิสิต','$เบอร์โทรศัพท์' ,'$email', '$การเรียนการสอน','$คณะ','$รหัสสาขา','$ชั้นปี',
            '$ขอเรียนควบในภาค','$ปีการศึกษา','$คะแนนเฉลี่ยสะสม','$รหัสวิชาวิชาบังคับก่อน','$ชื่อวิชาวิชาบังคับก่อน','$ระดับคะแนนเดิม',
            '$หมู่ลงทะเบียนเทอมปัจจุบัน','$รหัสวิชาวิชาต่อเนื่อง','$ชื่อวิชาวิชาต่อเนื่อง','$หมู่เรียนวิชาต่อเนื่อง','$เนื่องจาก','รออนุมัติ')");
    
     

      echo "<script>
      alert('กรอกข้อมูลสำเร็จ');
      window.location.href='claim.php';
      </script>";
   
exit;

?>



